code_examples/ApacheKafka/prototype/kafka_services/scripts/soap_requests/stop_cons.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://consumerservice.kafka.template.sema2flow.dfki.de/">
   <soapenv:Header/>
   <soapenv:Body>
      <con:stopConsumer>
         <sessionToken>TOKEN</sessionToken>
         <serviceID>SERVICEID</serviceID>
         <extraParameters></extraParameters>
      </con:stopConsumer>
   </soapenv:Body>
</soapenv:Envelope>